; domain
(define (domain blockWorld)
    (:requirements :strips :typing)
    (:types block)
    (:predicates
        (on ?x - block ?y - block)
        (ontable ?x - block)
        (clear ?x - block)
        (handempty)
        (holding ?x - block)
    )
    (:action pick-up
        ;;; Action qui ramasse un bloc posé sur la table
        :parameters (?x - block)
        :precondition (and (clear ?x) (ontable ?x) (handempty))
        :effect (and (not (ontable ?x))
                (not (clear ?x))
                (not (handempty))
                (holding ?x))
    )
    (:action put-down
        ;;; Action qui pose un block ?x sur la table
        :parameters (?x - block)
        :precondition (holding ?x)
        :effect (and (ontable ?x)
                (clear ?x)
                (handempty)
                (not (holding ?x)))
    )
    (:action stack
        ;;; Action qui empile un block ?x sur un autre block ?y
        :parameters (?x - block ?y - block)
        :precondition (and (clear ?y) (holding ?x))
        :effect (and (on ?x ?y)
                (clear ?x)
                (handempty)
                (not (clear ?y))
                (not (holding ?x)))
    )
    (:action unstack
        ;;; Action qui dépile un block ?x d'un autre block ?y
        :parameters (?x - block ?y - block)
        :precondition (and (on ?x ?y) (clear ?x) (handempty))
        :effect (and (holding ?x)
                (clear ?y)
                (not (on ?x ?y))
                (not (clear ?x))
                (not (handempty)))
    )
)

; problem
(define (problem blockProblem2)
    (:domain blockWorld)
    (:objects A B C D E F - block)
    (:init  (clear A)
            (on A C)
            (on C E)
            (ontable E)
            (clear B)
            (on B D)
            (on D F)
            (ontable F)
            (handempty))
    (:goal (and (on A B) (on B C) (on C D) (on D E) (on E F) (clear A) (ontable F) (handempty)))
)

; plan
1. (unstack a c)
   deleted: (on a c) (clear a) (handempty)
   added: (holding a) (clear c)
   goals met: 1 of 8
2. (put-down a)
   deleted: (holding a)
   added: (ontable a) (clear a) (handempty)
   goals met: 3 of 8
3. (unstack b d)
   deleted: (on b d) (clear b) (handempty)
   added: (holding b) (clear d)
   goals met: 2 of 8
4. (put-down b)
   deleted: (holding b)
   added: (ontable b) (clear b) (handempty)
   goals met: 3 of 8
5. (unstack d f)
   deleted: (on d f) (clear d) (handempty)
   added: (holding d) (clear f)
   goals met: 2 of 8
6. (put-down d)
   deleted: (holding d)
   added: (ontable d) (clear d) (handempty)
   goals met: 3 of 8
7. (unstack c e)
   deleted: (on c e) (clear c) (handempty)
   added: (holding c) (clear e)
   goals met: 2 of 8
8. (stack c d)
   deleted: (clear d) (holding c)
   added: (on c d) (clear c) (handempty)
   goals met: 4 of 8
9. (pick-up e)
   deleted: (ontable e) (clear e) (handempty)
   added: (holding e)
   goals met: 3 of 8
10. (stack e f)
   deleted: (clear f) (holding e)
   added: (on e f) (clear e) (handempty)
   goals met: 5 of 8
11. (unstack c d)
   deleted: (on c d) (clear c) (handempty)
   added: (holding c) (clear d)
   goals met: 3 of 8
12. (put-down c)
   deleted: (holding c)
   added: (ontable c) (clear c) (handempty)
   goals met: 4 of 8
13. (pick-up d)
   deleted: (ontable d) (clear d) (handempty)
   added: (holding d)
   goals met: 3 of 8
14. (stack d e)
   deleted: (clear e) (holding d)
   added: (on d e) (clear d) (handempty)
   goals met: 5 of 8
15. (pick-up c)
   deleted: (ontable c) (clear c) (handempty)
   added: (holding c)
   goals met: 4 of 8
16. (stack c d)
   deleted: (clear d) (holding c)
   added: (on c d) (clear c) (handempty)
   goals met: 6 of 8
17. (pick-up b)
   deleted: (ontable b) (clear b) (handempty)
   added: (holding b)
   goals met: 5 of 8
18. (stack b c)
   deleted: (clear c) (holding b)
   added: (on b c) (clear b) (handempty)
   goals met: 7 of 8
19. (pick-up a)
   deleted: (ontable a) (clear a) (handempty)
   added: (holding a)
   goals met: 5 of 8
20. (stack a b)
   deleted: (clear b) (holding a)
   added: (on a b) (clear a) (handempty)
   goals met: 8 of 8
